Updating gallery.
